V1/Data/linkerd-2/60-4-wrk2-zcqpn.log
Running 5m test @ http://face/
  8 threads and 200 connections
  Thread calibration: mean lat.: 18.638ms, rate sampling interval: 57ms
  Thread calibration: mean lat.: 19.619ms, rate sampling interval: 62ms
  Thread calibration: mean lat.: 21.527ms, rate sampling interval: 62ms
  Thread calibration: mean lat.: 20.985ms, rate sampling interval: 63ms
  Thread calibration: mean lat.: 22.256ms, rate sampling interval: 56ms
  Thread calibration: mean lat.: 22.764ms, rate sampling interval: 69ms
  Thread calibration: mean lat.: 21.524ms, rate sampling interval: 57ms
  Thread calibration: mean lat.: 16.753ms, rate sampling interval: 35ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    22.05ms   18.80ms 153.73ms   92.77%
    Req/Sec     2.46     25.59   735.00     98.60%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   16.40ms
 75.000%   22.74ms
 90.000%   31.38ms
 99.000%  115.52ms
 99.900%  144.90ms
 99.990%  148.48ms
 99.999%  153.85ms
100.000%  153.85ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       7.731     0.000000            1         1.00
      11.447     0.100000          566         1.11
      12.679     0.200000         1129         1.25
      13.807     0.300000         1693         1.43
      15.015     0.400000         2257         1.67
      16.399     0.500000         2827         2.00
      17.199     0.550000         3103         2.22
      18.367     0.600000         3385         2.50
      19.855     0.650000         3667         2.86
      21.343     0.700000         3949         3.33
      22.735     0.750000         4233         4.00
      23.359     0.775000         4374         4.44
      24.047     0.800000         4517         5.00
      24.735     0.825000         4655         5.71
      26.191     0.850000         4796         6.67
      28.191     0.875000         4936         8.00
      29.695     0.887500         5007         8.89
      31.375     0.900000         5078        10.00
      33.983     0.912500         5149        11.43
      38.335     0.925000         5218        13.33
      51.231     0.937500         5289        16.00
      54.943     0.943750         5324        17.78
      62.687     0.950000         5359        20.00
      70.847     0.956250         5395        22.86
      77.503     0.962500         5430        26.67
      82.751     0.968750         5465        32.00
      85.119     0.971875         5484        35.56
      88.447     0.975000         5501        40.00
      92.607     0.978125         5518        45.71
      96.255     0.981250         5537        53.33
     101.823     0.984375         5553        64.00
     106.175     0.985938         5562        71.11
     108.799     0.987500         5571        80.00
     113.535     0.989062         5580        91.43
     116.927     0.990625         5589       106.67
     120.127     0.992188         5597       128.00
     122.047     0.992969         5602       142.22
     123.519     0.993750         5607       160.00
     124.671     0.994531         5611       182.86
     126.655     0.995313         5615       213.33
     128.127     0.996094         5619       256.00
     130.111     0.996484         5622       284.44
     131.007     0.996875         5624       320.00
     132.223     0.997266         5626       365.71
     135.679     0.997656         5628       426.67
     138.879     0.998047         5630       512.00
     143.615     0.998242         5632       568.89
     144.255     0.998437         5633       640.00
     144.511     0.998633         5634       731.43
     144.895     0.998828         5635       853.33
     145.151     0.999023         5636      1024.00
     146.303     0.999121         5637      1137.78
     146.303     0.999219         5637      1280.00
     147.455     0.999316         5638      1462.86
     147.455     0.999414         5638      1706.67
     147.839     0.999512         5639      2048.00
     147.839     0.999561         5639      2275.56
     147.839     0.999609         5639      2560.00
     148.479     0.999658         5640      2925.71
     148.479     0.999707         5640      3413.33
     148.479     0.999756         5640      4096.00
     148.479     0.999780         5640      4551.11
     148.479     0.999805         5640      5120.00
     153.855     0.999829         5641      5851.43
     153.855     1.000000         5641          inf
#[Mean    =       22.054, StdDeviation   =       18.803]
#[Max     =      153.728, Total count    =         5641]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  6008 requests in 5.00m, 2.22MB read
  Socket errors: connect 0, read 0, write 0, timeout 24000
Requests/sec:     20.02
Transfer/sec:      7.56KB