V1/Data/linkerd-2/600-2-wrk2-fx7c8.log
Running 5m test @ http://face/
  8 threads and 200 connections
  Thread calibration: mean lat.: 46.275ms, rate sampling interval: 140ms
  Thread calibration: mean lat.: 46.326ms, rate sampling interval: 134ms
  Thread calibration: mean lat.: 46.747ms, rate sampling interval: 141ms
  Thread calibration: mean lat.: 46.585ms, rate sampling interval: 139ms
  Thread calibration: mean lat.: 46.746ms, rate sampling interval: 140ms
  Thread calibration: mean lat.: 47.148ms, rate sampling interval: 138ms
  Thread calibration: mean lat.: 47.987ms, rate sampling interval: 143ms
  Thread calibration: mean lat.: 45.618ms, rate sampling interval: 131ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    49.24ms   22.73ms 323.07ms   81.04%
    Req/Sec    24.92     47.02   192.00     83.32%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   47.04ms
 75.000%   57.41ms
 90.000%   69.38ms
 99.000%  132.10ms
 99.900%  229.38ms
 99.990%  313.09ms
 99.999%  319.23ms
100.000%  323.33ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       9.703     0.000000            1         1.00
      26.255     0.100000         5798         1.11
      33.055     0.200000        11580         1.25
      38.271     0.300000        17370         1.43
      42.911     0.400000        23152         1.67
      47.039     0.500000        28966         2.00
      48.927     0.550000        31837         2.22
      50.911     0.600000        34729         2.50
      52.959     0.650000        37660         2.86
      55.071     0.700000        40528         3.33
      57.407     0.750000        43452         4.00
      58.655     0.775000        44878         4.44
      60.031     0.800000        46316         5.00
      61.759     0.825000        47770         5.71
      63.647     0.850000        49208         6.67
      66.111     0.875000        50651         8.00
      67.647     0.887500        51390         8.89
      69.375     0.900000        52108        10.00
      71.807     0.912500        52816        11.43
      75.199     0.925000        53544        13.33
      79.871     0.937500        54266        16.00
      83.327     0.943750        54626        17.78
      87.871     0.950000        54991        20.00
      93.055     0.956250        55349        22.86
      98.047     0.962500        55710        26.67
     103.231     0.968750        56071        32.00
     106.303     0.971875        56255        35.56
     109.503     0.975000        56433        40.00
     113.343     0.978125        56613        45.71
     117.375     0.981250        56795        53.33
     122.175     0.984375        56976        64.00
     124.351     0.985938        57066        71.11
     126.975     0.987500        57157        80.00
     130.111     0.989062        57246        91.43
     133.631     0.990625        57337       106.67
     136.959     0.992188        57427       128.00
     140.031     0.992969        57475       142.22
     142.719     0.993750        57519       160.00
     145.535     0.994531        57564       182.86
     149.375     0.995313        57608       213.33
     155.007     0.996094        57653       256.00
     159.359     0.996484        57676       284.44
     164.607     0.996875        57699       320.00
     174.463     0.997266        57721       365.71
     187.903     0.997656        57744       426.67
     202.239     0.998047        57767       512.00
     207.487     0.998242        57778       568.89
     212.479     0.998437        57789       640.00
     216.575     0.998633        57800       731.43
     224.255     0.998828        57813       853.33
     230.143     0.999023        57823      1024.00
     234.623     0.999121        57829      1137.78
     242.687     0.999219        57834      1280.00
     270.079     0.999316        57840      1462.86
     278.783     0.999414        57846      1706.67
     285.183     0.999512        57851      2048.00
     291.583     0.999561        57854      2275.56
     295.935     0.999609        57857      2560.00
     298.751     0.999658        57860      2925.71
     304.127     0.999707        57863      3413.33
     307.199     0.999756        57865      4096.00
     308.223     0.999780        57867      4551.11
     308.479     0.999805        57868      5120.00
     310.527     0.999829        57870      5851.43
     311.551     0.999854        57871      6826.67
     312.575     0.999878        57872      8192.00
     313.087     0.999890        57873      9102.22
     313.855     0.999902        57874     10240.00
     314.367     0.999915        57875     11702.86
     314.367     0.999927        57875     13653.33
     314.623     0.999939        57876     16384.00
     314.623     0.999945        57876     18204.44
     318.207     0.999951        57877     20480.00
     318.207     0.999957        57877     23405.71
     318.207     0.999963        57877     27306.67
     319.231     0.999969        57878     32768.00
     319.231     0.999973        57878     36408.89
     319.231     0.999976        57878     40960.00
     319.231     0.999979        57878     46811.43
     319.231     0.999982        57878     54613.33
     323.327     0.999985        57879     65536.00
     323.327     1.000000        57879          inf
#[Mean    =       49.244, StdDeviation   =       22.735]
#[Max     =      323.072, Total count    =        57879]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  60008 requests in 5.00m, 22.15MB read
Requests/sec:    200.01
Transfer/sec:     75.59KB